karrister/pic16f_wiznet/MPLAB/pic16_eth_test.X/main.c
/*reg addr end*/

typedef unsigned char BYTE;
typedef BYTE KARRI_BOOL;

typedef enum {
            IDLE,
            LISTENING,
            PEER_CONNECTED,
            REQUEST_RECEIVED,
            PARSE_REQUEST,
            SEND_RESPONSE,
            WAIT_BEFORE_IDLE,
            CLOSE_SOCKET,
            DISCONNECT_SOCKET,
} mainserverSM;

typedef enum {
            PARSE_NO_MATCH,
            PARSE_MATCH,
            TOGGLE_LED1,
            TOGGLE_LED2,
            TOGGLE_LED3,
            TOGGLE_LED4,
} PARSE_STATUS;

/*Static */

/*static const saves it in the program memory, not RAM*/

static const BYTE get_cmd[] = "GET /";

/* This is the template for the website published on our PIC-server */
static const BYTE website_body[] =
" \
<HEAD> \
<TITLE>PIC16-webserver</TITLE> \
</HEAD> \
<BODY> \
<H2>Welcome to pic16server. Toggle LEDs: \
<H1> \
<a href=\"toggle_led1\">LED1</a> \
<a href=\"toggle_led2\">LED2</a> \
<a href=\"toggle_led3\">LED3</a> \
<a href=\"toggle_led4\">LED4</a> \
<br><br> \
<H2>Status:<P> \
<H1> \
";

/*
<HEAD>
<TITLE>PIC18-webserver</TITLE>
</HEAD>
<BODY>
<H2>Welcome to picserver. Toggle LEDs:
<H1>
<a href="toggle_led1">LED1</a>
<a href="toggle_led2">LED2</a>
<a href="toggle_led3">LED3</a>
<a href="toggle_led4">LED4</a>
<br><br>
<H2>Status:<P>
<H1>
LED1 <font color='green'>ON</font>
LED2 <font color='green'>ON</font>
LED3 <font color='red'>OFF</font>
LED4 <font color='green'>ON</font>
</body>
 */
#define DYNAMIC_HTML_LINE_MAX_SIZE 35 //length of the text: LED1 <font color='green'>ON</font>

static const BYTE website_body_end[] = "</BODY>";


/*Globals*/
short g_portc = 0;


int g_rx_sock0_mask;
int g_rx_sock0_base;

int g_tx_sock0_mask;
int g_tx_sock0_base;

int g_mainSM_state = IDLE;

/*Macros for turning LEDs on*/
#define LED1_ON() \
  do { \
    g_portc |= 0x01; \
    PORTC = g_portc;\
  } while (0)

#define LED2_ON() \
  do { \
    g_portc |= 0x02; \
    PORTC = g_portc;\
  } while (0)

#define LED3_ON() \
  do { \
    g_portc |= 0x04; \
    PORTC = g_portc;\
  } while (0)

#define LED4_ON() \
  do { \
    g_portc |= 0x08; \
    PORTC = g_portc;\
  } while (0)

/*Macros for turning LEDs off*/
#define LED1_OFF() \
  do { \
    g_portc &= 0xFE; \
    PORTC = g_portc;\
  } while (0)

#define LED2_OFF() \
  do { \
    g_portc &= 0xFD; \
    PORTC = g_portc;\
  } while (0)

#define LED3_OFF() \
  do { \
    g_portc &= 0xFB; \
    PORTC = g_portc;\
  } while (0)

#define LED4_OFF() \
  do { \
    g_portc &= 0xF7; \
    PORTC = g_portc;\
  } while (0)

#define LED1_TOGGLE() \
  do { \
    g_portc ^= 0x01; \
    PORTC = g_portc;\
  } while (0)

#define LED2_TOGGLE() \
  do { \
    g_portc ^= 0x02; \
    PORTC = g_portc;\
  } while (0)

#define LED3_TOGGLE() \
  do { \
    g_portc ^= 0x04; \
    PORTC = g_portc;\
  } while (0)

#define LED4_TOGGLE() \
  do { \
    g_portc ^= 0x08; \
    PORTC = g_portc;\
  } while (0)

/* Read the status of the LEDs */
#define LED1_STATUS() (PORTC && 0x01)
#define LED2_STATUS() (PORTC && 0x02)
#define LED3_STATUS() (PORTC && 0x04)
#define LED4_STATUS() (PORTC && 0x08)



#define RESET_LOW() \
  do { \
    PORTCbits.RC4 = 0; \
  } while (0)

#define RESET_HIGH() \
  do { \
    g_portc = PORTC;\
    g_portc |= BIT4;\
    PORTC = g_portc;\
  } while (0)


/*SPI macros*/
#define CS_ASSERT() \
  do { \
    PORTCbits.RC6 = 0; \
  } while (0)

#define CS_DEASSERT() \
  do { \
    PORTCbits.RC6 = 1; \
  } while (0)


#define DELAY_BETWEEN_COMMANDS() delay(5000)

#define SPI_SYNC_TX_BYTE(tx_byte) \
    do { \
        PIR1bits.SSPIF = 0; \
        SSPBUF = tx_byte; \
        while(!PIR1bits.SSPIF); \
        PIR1bits.SSPIF = 0; \
    } while(0)


#define WIZNET_WRITE(addr, byte) \
    do { \
        CS_ASSERT();\
        SPI_SYNC_TX_BYTE(0xF0);\
        SPI_SYNC_TX_BYTE((addr & 0xFF00) >> 8);\
        SPI_SYNC_TX_BYTE(addr & 0x00FF);\
        SPI_SYNC_TX_BYTE(byte);\
        CS_DEASSERT();\
    } while(0)


#ifdef UART_DEBUG
/**
* This inline function outputs debug messages out of the chip UART bus.
* @param msg The debug message. IMPORTANT: The last char needs to be newline,
*            otherwise the function will block forever.
* @return void
*/
inline void debug_print(DEBUG_MSG *msg)
{
    int x;
    for(x=0;x<MAX_UART_PRINT_LENGTH;x++)
    {
        if(msg[x] == '\n') //break character
        {
            break;
        }

        while(!TXSTAbits.TRMT);

        TXREG = msg[x];
    }

    while(!TXSTAbits.TRMT);
    TXREG = 0x0A;
    while(!TXSTAbits.TRMT);
    TXREG = 0x0D;

}
#else
inline void debug_print(DEBUG_MSG *msg)
{
    _nop();
}
#endif //UART_DEBUG

/**
* This inline function reads a single byte from the chip. This function manages
* the data transfer over the SPI bus from the chip towards the master.
* @param addr The address inside the chip to read from.
* @return The byte read from the chip.
*/
inline unsigned char
wiznet_read(unsigned int addr)
{
    unsigned char rxByte = 0;
    CS_ASSERT();
    SPI_SYNC_TX_BYTE(READ_OPCODE);
    SPI_SYNC_TX_BYTE((addr & 0xFF00) >> 8);
    SPI_SYNC_TX_BYTE(addr & 0x00FF);
    SPI_SYNC_TX_BYTE(0x00); //dummy data, just for clock output
    rxByte = SSPBUF;
    CS_DEASSERT();
    return rxByte;
}


/**
* This function compares the input buffer to a command buffer and tries to find
* the specified command inside the input buffer (the offset doesn't matter).
* @param eth_buff pointer to the input buffer.
* @param cmd pointer to the command buffer.
* @param input_size the size of the data in the eth_buff input buffer
* @param cmd_size the size of the command we are looking for
* @param buffer_offset pointer to uint where the function will save the offset in the input buffer where the match was found
* @see main()
* @return The boolean result if the specified command was found inside the input buffer.
*/
inline KARRI_BOOL compare_buffers(BYTE *eth_buff, BYTE *cmd, unsigned int input_size, unsigned int cmd_size, unsigned int *buffer_offset)
{
    int get_cmd_lookup_loop, get_cmd_matching_loop;
    for(get_cmd_lookup_loop = 0; get_cmd_lookup_loop < input_size; get_cmd_lookup_loop++)
    {
        *buffer_offset = get_cmd_lookup_loop;
        if(eth_buff[get_cmd_lookup_loop] == cmd[0])
        {
            for(get_cmd_matching_loop = 0; get_cmd_matching_loop < cmd_size; get_cmd_matching_loop++)
            {
                if(eth_buff[get_cmd_lookup_loop + get_cmd_matching_loop] != cmd[get_cmd_matching_loop])
                {
                    /* No CMD found afterall */
                    return KARRI_NOK;
                }
            }
            /* If we get here, it means we got successfully out of the for-loop and found our CMD */
            return KARRI_OK;
        }
    }

    /* If we get here, it means we couldn't find our CMD */
    return KARRI_NOK;
}

inline void zeromem(BYTE *memory, unsigned int size)
{ /* clear out the buffer */
    unsigned int x;
    for(x = size; x > 0; x--)
    {
        memory[x] = 0;
    }
}


/**
* This function compares the input buffer to a command buffer and tries to find
* the specified command inside the input buffer (the offset doesn't matter).
* If there was a match, next task is to find out, starting from the offset of
* after the basic command, looking through the incoming ethernet buffer and trying
* to find some specific commands, and returning the result as a PARSE_STATUS enum.
* @param eth_buff pointer to the input buffer.
* @param cmd pointer to the command buffer.
* @param input_size the size of the data in the eth_buff input buffer
* @param cmd_size the size of the command we are looking for
* @see compare_buffers()
* @see main()
* @return The result of the parsing.
*/
inline PARSE_STATUS parse_command(BYTE *eth_buff, BYTE *cmd, unsigned int input_size, unsigned int cmd_size)
{
    PARSE_STATUS ret = PARSE_NO_MATCH;
    BYTE        *command_buffer;
    unsigned int buffer_offset;
    if(!compare_buffers(eth_buff, cmd, input_size, cmd_size, &buffer_offset))
    {
        debug_print("no match!\n");
        /* No match was found, return immediately */
        return PARSE_NO_MATCH;
    }

    debug_print("match! continue parsing\n");

    /* Let's make the buffer to point to local pointer from the wanted offset, after the initial command */
    command_buffer = eth_buff + buffer_offset + cmd_size;

    /* Get ready... Here is the huge parser! */
    if(command_buffer[0] == 't' &&
       command_buffer[1] == 'o' &&
       command_buffer[2] == 'g' &&
       command_buffer[3] == 'g' &&
       command_buffer[4] == 'l' &&
       command_buffer[5] == 'e' &&
       command_buffer[6] == '_' &&
       command_buffer[7] == 'l' &&
       command_buffer[8] == 'e' &&
       command_buffer[9] == 'd')
    {
        debug_print("command matched!\n");
        switch(command_buffer[10])
        {
            case '1':
                ret = TOGGLE_LED1;
                break;
            case '2':
                ret = TOGGLE_LED2;
                break;
            case '3':
                ret = TOGGLE_LED3;
                break;
            case '4':
                ret = TOGGLE_LED4;
                break;
            default:
                ret = PARSE_NO_MATCH;
                break;
        }
    }
    
    return ret;
}


