karrister/pic16f_wiznet/MPLAB/pic16_eth_test.X/main.c
#ifdef KARRI_DEBUG
    LED1_OFF();
    debug_print("Went through CHIP init, entering main state machine!\n");
#endif

    BYTE spi_rx_byte                          = 0;

    unsigned int rx_data_size                 = 0;

    unsigned int rx_data_offset               = 0;
    unsigned int rx_data_start_addr           = 0;
    unsigned int rx_sock1_read_pointer        = 0;
    unsigned int rx_upper_size                = 0;

    unsigned int tx_data_size                 = 0;
    unsigned int tx_data_offset               = 0;
    unsigned int tx_data_start_addr           = 0;
    unsigned int tx_sock1_write_pointer       = 0;
    unsigned int tx_upper_size                = 0;

    unsigned short tx_getsize_timeout_counter = 0;

    PARSE_STATUS parse_status = PARSE_NO_MATCH;

    //unsigned char print[] = "rx size: xxxx\n";

    //BYTE int_string[] = "0123";

    BYTE eth_buff[ETHERNET_BUFF_SIZE];

    unsigned int sock0_base_addr = 0;

    //Get sock0 base address for all the subsequent calls
    sock0_base_addr = get_sock_base_addr_by_sock_num(SOCK0);

#define KARRI_DEBUG_SM

    while(1)
    {
        switch(g_mainSM_state)
        {
            case IDLE:
#ifdef KARRI_DEBUG_SM
                debug_print("mainSM: case IDLE\n");
#endif
                /**SET SERVER SOCKET**/

                //Make sure socket is closed!
                spi_rx_byte = wiznet_read(0x0403);

                if(spi_rx_byte != SOCK_CLOSED)
                {
                    g_mainSM_state = CLOSE_SOCKET;
                    break;
                }

                //Set TCP mode
                WIZNET_WRITE(GET_SOCK_HW_ADDR_FROM_OFFSET(sock0_base_addr, SOCK_REG_MODE),0x01);
                //Set port to 80 (www);
                WIZNET_WRITE(GET_SOCK_HW_ADDR_FROM_OFFSET(sock0_base_addr, SOCK_REG_SOURCE_PORT0),0x00);
                WIZNET_WRITE(GET_SOCK_HW_ADDR_FROM_OFFSET(sock0_base_addr, SOCK_REG_SOURCE_PORT1),0x50);
                
                //Set socket to open
                WIZNET_WRITE(GET_SOCK_HW_ADDR_FROM_OFFSET(sock0_base_addr, SOCK_REG_COMMAND),OPEN);

                /* Block while chip is processing command */
                do {
                    spi_rx_byte = wiznet_read(0x0401);
                } while(spi_rx_byte);

                //Read status from chip
                spi_rx_byte = wiznet_read(0x0403);

                if(spi_rx_byte != SOCK_INIT)
                {
                    g_mainSM_state = CLOSE_SOCKET;
                    break;
                }

                //Set socket to listen
                WIZNET_WRITE(0x0401,LISTEN);

                /* Block while chip is processing command */
                do {
                    spi_rx_byte = wiznet_read(0x0401);
                } while(spi_rx_byte);

                //Read status from chip
                spi_rx_byte = wiznet_read(0x0403);

                g_mainSM_state = LISTENING;

                if(spi_rx_byte != SOCK_LISTEN)
                {
                    g_mainSM_state = CLOSE_SOCKET;
                }

                break;

            case LISTENING:
#ifdef KARRI_DEBUG_SM
                debug_print("mainSM: case LISTENING\n");
#endif
                DELAY_BETWEEN_COMMANDS();
                //Read status from chip
                spi_rx_byte = wiznet_read(0x0403);

                if(spi_rx_byte == SOCK_ESTABLISHED)
                {
                    g_mainSM_state = PEER_CONNECTED;
                }
                else if(spi_rx_byte != SOCK_LISTEN){
                    g_mainSM_state = CLOSE_SOCKET;
                }
                break;

            case PEER_CONNECTED:
#ifdef KARRI_DEBUG_SM
                debug_print("mainSM: case PEER_CONNECTED\n");
#endif

                //Get the size of received data size of socket 0
                spi_rx_byte = wiznet_read(0x0426);
                rx_data_size = (unsigned int)(spi_rx_byte << 8);
                spi_rx_byte = wiznet_read(0x0427);
                rx_data_size |= spi_rx_byte;


                if(rx_data_size > 0)
                {
                    g_mainSM_state = REQUEST_RECEIVED;
                }
                /*
                 * When working as a server and receiving data from
                 * a client, and the data size is too much for us
                 * (afterall, we only have 256 bytes of RAM), currently, on this MCU
                 * and this application, we will just RESET the CHIP and PIC,
                 * and we DULY NOTE THIS IS A SEVERE SECURITY HOLE IN A NORMAL
                 * NETWORK ENVIRONMENT. (but dont give a heck at the moment)
                 */
                if(rx_data_size > MAX_RX_SIZE)
                {
#ifdef KARRI_DEBUG
                    debug_print("RX too long, truncating!\n");
#endif
                    /* If the received data is longer than our receive buffer,
                     * we'll just truncate the data. */
                    rx_data_size = MAX_RX_SIZE - 1;
                }

                DELAY_BETWEEN_COMMANDS();
                //Check if socket has been closed
                spi_rx_byte = wiznet_read(0x0403);
                if(spi_rx_byte == SOCK_CLOSED ||
                   spi_rx_byte == SOCK_CLOSE_WAIT)
                {
                    g_mainSM_state = CLOSE_SOCKET;
                    break;
                }

                break;

            case REQUEST_RECEIVED:
#ifdef KARRI_DEBUG_SM
                debug_print("mainSM: case REQUEST_RECEIVED\n");
#endif

//#define KARRI_DEBUG_RX_PATH

#ifdef KARRI_DEBUG_RX_PATH
                sprintf( int_string, "RX size: %d\n", rx_data_size );
                debug_print(int_string);
#endif

#ifdef EXTENDED_FUNCTIONALITY

                //Get the read pointer to received data of socket 0
                spi_rx_byte            = wiznet_read(0x0428);
                rx_sock1_read_pointer  = (spi_rx_byte << 8);

                spi_rx_byte            = wiznet_read(0x0429);
                rx_sock1_read_pointer |= spi_rx_byte;

                

                rx_data_offset         = rx_sock1_read_pointer & g_rx_sock0_mask;
                rx_data_start_addr     = g_rx_sock0_base + rx_data_offset;

                if((rx_data_size + rx_data_offset) > (g_rx_sock0_mask + 1))
                {//buffer wrap-around occured
                    unsigned int left_size = 0;
                    rx_upper_size = (g_rx_sock0_mask + 1) - rx_data_offset;

                    wiznet_read_bytes(rx_data_start_addr, eth_buff, rx_upper_size);

                    left_size = rx_data_size - rx_upper_size;

