karrister/pic16f_wiznet/MPLAB/pic16_eth_test.X/main.c
                    wiznet_read_bytes(g_rx_sock0_base, eth_buff+rx_upper_size, left_size);
                }
                else
                {
                    wiznet_read_bytes(rx_data_start_addr, eth_buff, rx_data_size);
                }

                //Update RX buff pointer & send command for RECV done
                rx_sock1_read_pointer += rx_data_size;

                WIZNET_WRITE(0x0428,((rx_sock1_read_pointer & 0xFF00) >> 8));
                WIZNET_WRITE(0x0429,( rx_sock1_read_pointer & 0x00FF)      );

                DELAY_BETWEEN_COMMANDS();

                WIZNET_WRITE(0x0401,RECV);

                /* Block while chip is receiving */
                do {
                    spi_rx_byte = wiznet_read(0x0401);
                } while(spi_rx_byte);

#endif
                g_mainSM_state = PARSE_REQUEST;
                break;

            case PARSE_REQUEST:
#ifdef KARRI_DEBUG_SM
                debug_print("mainSM: case PARSE_REQUEST\n");
#endif

#ifdef KARRI_DEBUG
                debug_print(eth_buff);
#endif
                DELAY_BETWEEN_COMMANDS();

                parse_status = parse_command(eth_buff, get_cmd, rx_data_size, (sizeof(get_cmd) - 1) ); /* We do minus 1 for the size because of the null character */

                if(parse_status >= PARSE_MATCH)
                {
                    switch(parse_status)
                    {
                        case TOGGLE_LED1:
                            LED1_TOGGLE();
                            break;
                        case TOGGLE_LED2:
                            LED2_TOGGLE();
                            break;
                        case TOGGLE_LED3:
                            LED3_TOGGLE();
                            break;
                        case TOGGLE_LED4:
                            LED4_TOGGLE();
                            break;
                    } 
                }

                zeromem(eth_buff, ETHERNET_BUFF_SIZE);

                g_mainSM_state = SEND_RESPONSE;
                break;

            case SEND_RESPONSE://send the web site as a response
#ifdef KARRI_DEBUG_SM
                debug_print("mainSM: case SEND_RESPONSE\n");
#endif
                //Check if socket has been closed
                spi_rx_byte = wiznet_read(0x0403);
                if(spi_rx_byte != SOCK_ESTABLISHED)
                {
                    g_mainSM_state = DISCONNECT_SOCKET;
                }
                //wait for TX buffer size availability
                do {
                    tx_getsize_timeout_counter++;
                    delay(600);
                    //Get the size of TX socket 0
                    spi_rx_byte = wiznet_read(0x0420);
                    tx_data_size = (unsigned int)(spi_rx_byte << 8);
                    spi_rx_byte = wiznet_read(0x0421);
                    tx_data_size |= spi_rx_byte;

                    if(TX_GETSIZE_TIMEOUT_THRESHOLD < tx_getsize_timeout_counter)
                    {
                        g_mainSM_state = DISCONNECT_SOCKET;
                        break;
                    }
                } while(tx_data_size < (sizeof(website_body) + sizeof(website_body_end) + DYNAMIC_HTML_LINE_MAX_SIZE) );



                //Get the write pointer
                spi_rx_byte = wiznet_read(0x0424);
                tx_sock1_write_pointer = ((spi_rx_byte & 0x00FF) << 8);
                spi_rx_byte = wiznet_read(0x0425);
                tx_sock1_write_pointer |= (spi_rx_byte & 0x00FF);

                tx_data_offset = tx_sock1_write_pointer & g_tx_sock0_mask;
                tx_data_start_addr = g_tx_sock0_base + tx_data_offset;
#if 1//karri test
                { /* Send the website */

                    BYTE temp_dynamic_line_buff[DYNAMIC_HTML_LINE_MAX_SIZE];
                    zeromem(temp_dynamic_line_buff, sizeof(temp_dynamic_line_buff));
#if 1
                    /*Test characters*/
                    temp_dynamic_line_buff[5] = 'K';
                    temp_dynamic_line_buff[6] = 'O';
                    temp_dynamic_line_buff[7] = 'R';
                    temp_dynamic_line_buff[8] = 'S';
                    temp_dynamic_line_buff[9] = 'O';
                    /**/
#endif

                    wiznet_write_bytes(tx_data_start_addr,
                                       website_body,
                                       sizeof(website_body));
                    tx_data_start_addr += sizeof(website_body);
#if 1
                    wiznet_write_bytes(tx_data_start_addr,
                                       temp_dynamic_line_buff,
                                       sizeof(temp_dynamic_line_buff));
                    tx_data_start_addr += sizeof(temp_dynamic_line_buff);
#endif

                    wiznet_write_bytes(tx_data_start_addr,
                                       website_body_end,
                                       sizeof(website_body_end));
                    tx_data_start_addr += sizeof(website_body_end);
                
                    tx_sock1_write_pointer = tx_sock1_write_pointer + (sizeof(website_body) + DYNAMIC_HTML_LINE_MAX_SIZE + sizeof(website_body_end));

                }
                

                WIZNET_WRITE(0x0424,((tx_sock1_write_pointer & 0xFF00) >> 8));
                WIZNET_WRITE(0x0425,( tx_sock1_write_pointer & 0x00FF)      );

                DELAY_BETWEEN_COMMANDS();

                WIZNET_WRITE(0x0401,SEND);

                /* Block while chip is sending */
                do {
                    spi_rx_byte = wiznet_read(0x0401);
                } while(spi_rx_byte);
#endif //karri test

                g_mainSM_state = DISCONNECT_SOCKET;
                break;

            case DISCONNECT_SOCKET:

                WIZNET_WRITE(0x0401,DISCON);

                /* Block while chip is disconnecting the socket */
                do {
                    spi_rx_byte = wiznet_read(0x0401);
                } while(spi_rx_byte);
                
                g_mainSM_state = CLOSE_SOCKET;
                /* fall-through to close socket */
            case CLOSE_SOCKET:

                WIZNET_WRITE(0x0401,CLOSE);

                /* Block while chip is closing the socket */
                do {
                    spi_rx_byte = wiznet_read(0x0401);
                } while(spi_rx_byte);

                g_mainSM_state = IDLE;
                break;
            default:/**ENDING UP HERE CAUSES A SOFTWARE RESET!**/
#ifdef KARRI_DEBUG
                debug_print("WARNING!! Doing a soft *RESET* to PIC soon!\n");
#endif
                WDTCONbits.SWDTEN = 1; //Enable watchdog timer! Let it reset the damn thing!
#ifdef KARRI_DEBUG
                debug_print("Watchdog starts kicking, we shall RESET immediately!\n");
#endif
                //RESET
                break;
        }

        DELAY_BETWEEN_COMMANDS();
        DELAY_BETWEEN_COMMANDS();
    }

#ifdef KARRI_DEBUG
    //Indicate firmware finished
    LED4_ON();

    debug_print("Firmware end, looping forever\n");
    while(1);
#endif //KARRI_DEBUG

    return 0;
}

